# AssemblyRenameTypeWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..AssemblyRenameTypeWarn Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Edits to these assemblies changed the naming category and name of these assemblies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AssemblyRenameTypeWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyRenameTypeWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AssemblyRenameTypeWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace